In [1]:
#Importação
import numpy as np
import pandas as pd

In [137]:
#Objetivo da aula é criar dataframe, serve para trabalhar dados de forma eficiente. Fundamental usar estrutura de dados apropriadas
array_vendas =np.array([
    ['Leandro', 'Carne', np.random.randint(1,6), np.round(np.random.uniform(10.0,45.0),1)],
    ['Daniele', 'Macarrao', None, np.round(np.random.uniform(8.0,45.0),1)],
    ['Joao', 'Arroz', np.random.randint(1,6), np.round(np.random.uniform(5.00,30.0),1)],
    ['Roberta', 'Feijao', np.random.randint(1,6), np.round(np.random.uniform(5.0,15.0),1)],
     ['Jessica', 'Carne', np.random.randint(1,6), None]
])
#Assim como numpy, é possivel fazer com propria lista do python
df = pd.DataFrame(array_vendas, columns=['Cliente', 'Produto', 'Quantidade', 'valor_unitario'])
print(df)

   Cliente   Produto Quantidade valor_unitario
0  Leandro     Carne          2           32.4
1  Daniele  Macarrao       None           19.4
2     Joao     Arroz          1           14.5
3  Roberta    Feijao          4           11.7
4  Jessica     Carne          3           None

In [89]:
#Criando dataframe com dicionario do python
dict_vendas = { 'Cliente':['Leandro', 'Daniele','Joao','Roberta','Jessica'],
                'Produto':['Carne','Macarrao','Arroz','Feijao','Carne'],
                'Quantidade':[2,2,3,4,3],
               'valor_unitario':[13.21,37.84,28.68,13.62,24.14]
              }
print(dict_vendas)
pd.DataFrame(dict_vendas)

{'Cliente': ['Leandro', 'Daniele', 'Joao', 'Roberta', 'Jessica'], 'Produto': ['Carne', 'Macarrao', 'Arroz', 'Feijao', 'Carne'], 'Quantidade': [2, 2, 3, 4, 3], 'valor_unitario': [13.21, 37.84, 28.68, 13.62, 24.14]}

   Cliente   Produto  Quantidade  valor_unitario
0  Leandro     Carne           2           13.21
1  Daniele  Macarrao           2           37.84
2     Joao     Arroz           3           28.68
3  Roberta    Feijao           4           13.62
4  Jessica     Carne           3           24.14

In [90]:
#Selecionando colunas e linhas usando metodo loc
df.loc[:, ['Cliente','Produto','Quantidade']]

#Onde df.loc[ Primeiramente as colunas ou linhas , ['aqui dentro vem as colunas que vão aparecer'] ]
#Feito dentro do array e pode ser usado com ele mesmo.

   Cliente   Produto Quantidade
0  Leandro     Carne          5
1  Daniele  Macarrao        nan
2     Joao     Arroz          1
3  Roberta    Feijao          2
4  Jessica     Carne          3

In [91]:
#Buscando direto por linha
df.loc[
    [1,3], :
]

   Cliente   Produto Quantidade valor_unitario
1  Daniele  Macarrao        nan            9.7
3  Roberta    Feijao          2           14.1

In [92]:
#Selecionando coluna especifica
df.loc[df['Produto'] == 'Feijao', ['Cliente','Quantidade','valor_unitario']]

   Cliente Quantidade valor_unitario
3  Roberta          2           14.1

In [93]:
#Selecionando por linha e coluna especifica 2 e 4
df.loc[2:4, 
    ['Produto', 'valor_unitario']
]

  Produto valor_unitario
2   Arroz           11.2
3  Feijao           14.1
4   Carne            nan

In [94]:
#METODO ILOC BUSCA COLUNAS E LINHAS POR NUMERO INTEIRO
df.iloc[ 
    [0,2],[1,3]
]

  Produto valor_unitario
0   Carne           11.1
2   Arroz           11.2

In [95]:
df.iloc[ :, [1,2]] #Trouxe todos e mostrou as colunas Produto e quantidade

    Produto Quantidade
0     Carne          5
1  Macarrao        nan
2     Arroz          1
3    Feijao          2
4     Carne          3

In [96]:
#METODO at e iat
df.at[2,'Quantidade']

'1'

In [97]:
df.iat[0,3] #No cliente 0, me traga o valor_unitario que seria indice 3. Indice zero seria o cliente

'11.1'

In [98]:
#Metodo head, traz as primeiras 5 linhas
x=5
df.head(x) #Um classico, o padrao vem 5, quando especificado (x) pode aumentar o valor

   Cliente   Produto Quantidade valor_unitario
0  Leandro     Carne          5           11.1
1  Daniele  Macarrao        nan            9.7
2     Joao     Arroz          1           11.2
3  Roberta    Feijao          2           14.1
4  Jessica     Carne          3            nan

In [99]:
#Metodo tail, inverso do head. Traz os ultimos
df.tail() #Assim como head, ele traz 5.

   Cliente   Produto Quantidade valor_unitario
0  Leandro     Carne          5           11.1
1  Daniele  Macarrao        nan            9.7
2     Joao     Arroz          1           11.2
3  Roberta    Feijao          2           14.1
4  Jessica     Carne          3            nan

In [100]:
#Metodo Sample
df.sample(2) #Traz qualquer linha do dataframe, padrão é 1

   Cliente   Produto Quantidade valor_unitario
3  Roberta    Feijao          2           14.1
1  Daniele  Macarrao        nan            9.7

In [101]:
#Metodo query realiza uma busca, uma query 
df.query('valor_unitario>"20" ') #Precisa colocar "" quando se coloca o que busca como chave

   Cliente   Produto Quantidade valor_unitario
1  Daniele  Macarrao        nan            9.7
4  Jessica     Carne          3            nan

In [102]:
#Metodo query buscando cliente
df.query('Cliente == "Roberta"')

   Cliente Produto Quantidade valor_unitario
3  Roberta  Feijao          2           14.1

In [103]:
#Metodo isin
#Permite selecionar subconjuntos de dados baseados em uma lista de valores. útil quando deseja selecionar linhas onde uma coluna especifica
#tem um valor que corresponde a um dos valores da lista
df[df["Quantidade"].isin(["3","4"])] #Buscar qual coluna em quantidade tem 3,4

   Cliente Produto Quantidade valor_unitario
4  Jessica   Carne          3            nan

In [104]:
#Selecionando as linhas que contem arroz e feijao
df[df['Produto'].isin(['Arroz', 'Feijao'])]

   Cliente Produto Quantidade valor_unitario
2     Joao   Arroz          1           11.2
3  Roberta  Feijao          2           14.1

In [105]:
#Ou pode ser o mesmo com query, o que é mais facil
df.query('Produto in ("Arroz", "Feijao")')

   Cliente Produto Quantidade valor_unitario
2     Joao   Arroz          1           11.2
3  Roberta  Feijao          2           14.1

In [112]:
#Manipulação e Correção de dados
#metodo isna busca valores nulos ou que estão faltando porém pode apresentar falhas com np.nan

#Sempre quando trabalhar com dataframe, verificar nas boas praticas, se tem falhas ou dados ausentes!
df.isna()

   Cliente  Produto  Quantidade  valor_unitario
0    False    False       False           False
1    False    False        True           False
2    False    False       False           False
3    False    False       False           False
4    False    False       False            True

In [113]:
df.isnull() #Funciona da mesma forma que isnan

   Cliente  Produto  Quantidade  valor_unitario
0    False    False       False           False
1    False    False        True           False
2    False    False       False           False
3    False    False       False           False
4    False    False       False            True

In [114]:
#Contar quantos registros estão ausentes
df.isna().sum()

Cliente           0
Produto           0
Quantidade        1
valor_unitario    1
dtype: int64

In [119]:
#Usando metodo where
df.where(df['Quantidade']>=1) #No cliente 1, a quantidade está none

   Cliente Produto Quantidade valor_unitario
0  Leandro   Carne          1           34.4
1      NaN     NaN        NaN            NaN
2     Joao   Arroz          2           28.3
3  Roberta  Feijao          4           15.0
4  Jessica   Carne          3           None

In [122]:
#Usando mask
df.mask(df['Quantidade']>=3)

   Cliente   Produto Quantidade valor_unitario
0  Leandro     Carne          1           34.4
1  Daniele  Macarrao       None           38.6
2     Joao     Arroz          2           28.3
3      NaN       NaN        NaN            NaN
4      NaN       NaN        NaN            NaN

In [123]:
#Realizando correção
media_quantidade = np.mean(df['Quantidade'])

np.float64(2.5)

In [125]:
df['Quantidade'].where(df['Quantidade'] >=1, media_quantidade)

0      1
1    2.5
2      2
3      4
4      3
Name: Quantidade, dtype: object

In [128]:
#Usando dropna, ele retira todos os valores ausentes
df_sem_faltantes = df.dropna()
df_sem_faltantes

   Cliente Produto Quantidade valor_unitario
0  Leandro   Carne          1           34.4
2     Joao   Arroz          2           28.3
3  Roberta  Feijao          4           15.0

In [130]:
#Pode também eliminar dados ausentes de colunas.
df_faltante = df.dropna(subset=['Quantidade']) #Tambem é possivel eliminar junto o valor_unitario
df_faltante

   Cliente Produto Quantidade valor_unitario
0  Leandro   Carne          1           34.4
2     Joao   Arroz          2           28.3
3  Roberta  Feijao          4           15.0
4  Jessica   Carne          3           None

In [132]:
#Metodo dropduplicates usado para remover linhas duplicadas.
duplicados = df.duplicated() #No caso nao temos duplicado mas podemos incluir
#Caso tenha duplicado
df[duplicados]

Empty DataFrame
Columns: [Cliente, Produto, Quantidade, valor_unitario]
Index: []

In [136]:
#Metodo fillna preenche todos os valores ausentes
df.ffill()

C:\Users\Vitão\AppData\Local\Temp\ipykernel_24408\3993378869.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.ffill()

   Cliente   Produto  Quantidade  valor_unitario
0  Leandro     Carne           4            34.1
1  Daniele  Macarrao           4            16.7
2     Joao     Arroz           3            29.1
3  Roberta    Feijao           2            12.6
4  Jessica     Carne           3            12.6

In [144]:
#Existe também o replace.
df.replace({'Quantidade':{None:'1'}}) 
#df.replace({'valor_unitario':{None:'10.0'}})
df.replace(
    {'Quantidade':{None:'1'},
    'valor_unitario':{None:'10.0'}
    
    }
)

   Cliente   Produto Quantidade valor_unitario
0  Leandro     Carne          2           32.4
1  Daniele  Macarrao          1           19.4
2     Joao     Arroz          1           14.5
3  Roberta    Feijao          4           11.7
4  Jessica     Carne          3           10.0